// Определим тип для одного объекта субтитра для удобства
export interface Subtitle {
    start: number;
    end: number;
    ru: string;
    tt: string;
    lang: string;
    ar?: string; // Арабский текст опционален
}

export const subtitlesData: Subtitle[] = [
    { start: 27.2, end: 33.42, ru: 'Мы рады приветствовать гостей и участников восьмого Международного Золотардынского форума.', tt: 'Сигезенче Халыкара Алтын Урда форумында катнашучыларны һәм кунакларны каршы алуыбызга шатбыз.', lang: 'ru' },
    { start: 33.42, end: 43.0, ru: 'Они вносят существенный вклад в изучение истории как татарского народа, так и народов Республики Татарстан и в целом истории России.', tt: 'Алар татар халкының, Татарстан Республикасы халыкларының һәм гомумән, Россия тарихының тарихын өйрәнүгә зур өлеш кертә.', lang: 'ru' },
    { start: 46.7, end: 57.5, ru: 'Лусджучи или Золотая Орда является неотлеваемой частью российского культурного пространства и является частью общероссийского прошлого.', tt: 'Лусджучи, ягъни Алтын Урда, Россия мәдәниятенең аерылгысыз өлеше булып тора һәм гомумроссия үткәненең өлеше булып тора.', lang: 'ru' },
    { start: 59.7, end: 64.18, ru: 'في الواقع أنا مسرور جداً للمشاركة في هذا المؤتمر الدولي', tt: '', lang: 'ar', ar: 'في الواقع أنا مسرور جداً للمشاركة في هذا المؤتمر الدولي' },
    { start: 64.18, end: 73.0, ru: 'ولقد حسني الشرف بأن أكون من الشخصيات التي شدت الرحال من أقصى الغرب الإسلامي إلى أسير وسطة وبالضبط إلى قزان', tt: '', lang: 'ar', ar: 'ولقد حسني الشرف بأن أكون من الشخصيات التي شدت الرحال من أقصى الغرب الإسلامي إلى أسير وسطة وبالضبط إلى قزان' },
    { start: 74.0, end: 87.3, ru: 'Для меня, во-первых, произвело серьезное впечатление количество участников, среди них достаточно большой состав известных людей, историков. Когда у человека есть сильные корни, он всегда в этой жизни будет уверенно стоять на своих ногах.', tt: 'Минем өчен, беренчедән, катнашучыларның саны, шул исәптән билгеле кешеләр, тарихчылар саны да шактый зур иде, чөнки кешенең тамырлары нык булгач, ул бу тормышта һәрвакыт үз аякларында ышаныч белән торачак.', lang: 'ru' },
    { start: 95.0, end: 98.4, ru: 'В истории не бывает однозначно хорошего или плохого явления.', tt: 'Тарихта бернинди дә яхшы яки начар күренешләр юк.', lang: 'ru' },
    { start: 99.4, end: 105.0, ru: 'Мы из любого явления должны извлекать уроки для того, чтобы идти дальше.', tt: 'Алга таба барыр өчен, без һәркайсы күренештән сабак алырга тиеш.', lang: 'ru' },
    { start: 114.0, end: 129.2, ru: 'Золото-Арденский форум – это мероприятие, которое имеет уже в международном масштабе хороший отклик, хорошо известное и, наверное, одно из главных научных мероприятий по тематике истории средних веков евразийского пространства.', tt: 'Алтын-Ардэн форумы - халыкара дәрәҗәдә яхшы кабул ителгән, яхшы билгеле һәм, бәлки, Евразия киңлегенең урта гасырлар тарихы темасына багышланган төп фәнни чараларның берсе.', lang: 'ru' },
    { start: 133.6, end: 139.04, ru: 'Золотая Орда и Лос-Джучи – это те основы, на которых', tt: 'Алтын Урда һәм Лос-Джучи - бу нигезләр.', lang: 'ru' },
    { start: 139.04, end: 141.4, ru: 'построена государственность многих наших стран.', tt: 'Күп кенә илләребезнең дәүләтчелеге төзелгән.', lang: 'ru' },
    { start: 162.5, end: 167.84, ru: 'Международный Золотардынский форум – это уже такой бренд для всех специалистов,', tt: 'Халыкара Алтын Урда форумы инде барлык белгечләр өчен шундый бренд.', lang: 'ru' },
    { start: 168.04, end: 171.66, ru: 'кто занимается золотардынским периодом, периодом татарских ханцев,', tt: 'Алтын чоры, татар ханнары чоры,', lang: 'ru' },
    { start: 171.78, end: 174.5, ru: 'для тех, кто занимается средними веками.', tt: ' урта гасырлар белән шөгыльләнүчеләр өчен.', lang: 'ru' },
    { start: 176.4, end: 184.0, ru: 'И мы, конечно, как организаторы, всегда готовы принять наших уважаемых коллег в Казани, в Булгарии, в Татарстане.', tt: 'Һәм без, әлбәта, оештыручылар буларак, Казанда, Болгариядә, Татарстанда хөрмәтле хезмәттәшләребезне кабул итәргә һәрвакыт әзер.', lang: 'ru' }
];